/*******************************************************************************************************
**Copyright (c) 2014,云南卡巴的信息科技有限公司  Carbd Information Science & Technology Yunnan co ., LTD.
** All rights reserved.
**
** File name:			
** Descriptions:		
**------------------------------------------------------------------------------------------------------
** Created by:	            jhj		
** Version:				1.0
** Descriptions:		The original version
**------------------------------------------------------------------------------------------------------
** Version:
** Descriptions:
********************************************************************************************************/
#ifndef __CRC_H
#define __CRC_H
/******************* macro  *********************/
#include "GenericTypeDefs.h"
#include "stm32f10x.h"

u16 CRC16(u8 *puchMsg, u32 usDataLen);


/******************* END**************************/
#endif



